#pragma once

#include <atlstr.h>
#include <vector>


namespace ZipUtils
{
	// ------------------------------------------------------------------------------------------------------------------------
	// Summary:
	//   解压zip文件到指定路径
	// Parameters:
	//   lpszZipFullName   - 待解压 zip压缩包所在文件夹路径和zip压缩名称; 如"D://00//1.zip"。
	//   lpszUnZipPath     - 解压出来的文件 所存放位置的完整路径; 如 “D://01”
	// Returns:
	//   解压成功返回ZR_OK，解压失败返回错误码。
	// ------------------------------------------------------------------------------------------------------------------------
	DWORD ExtractZipToDir(LPCTSTR lpszZipFullName, LPCTSTR lpszUnZipPath, CString& lpszAllDirName );

	// ------------------------------------------------------------------------------------------------------------------------
	// Summary:
	//   压缩指定的文件，并保存指定的压缩包路径及名称。
	// Parameters:
	//   lpszSrcFile        - 待压缩文件所在的路径; 如"D://00//abc.txt"。
	//   lpszZipFullName    - 压缩完成后，存放压缩包的整个路径（D://00//abc.zip）。
	// Returns:
	//   压缩成功返回ZR_OK，压缩失败返回错误码。
	// ------------------------------------------------------------------------------------------------------------------------
	DWORD CompressFileToZip(LPCTSTR lpszSrcFile,LPCTSTR lpszZipFullName);

	// ------------------------------------------------------------------------------------------------------------------------
	// Summary:
	//   压缩指定路径下的多个文件，并保存压缩包到指定路径。
	// Parameters:
	//   lpszSrcDir        - 待压缩文件所在的路径; 如"D://00"。
	//   lpszZipFullName    - 压缩完成后，存放压缩包的整个路径（D://00//abc.zip）。
	//   vFileName          - 要压缩的文件列表;
	// Returns:
	//   压缩成功返回ZR_OK，压缩失败返回错误码。
	// ------------------------------------------------------------------------------------------------------------------------
	DWORD CompressFilesToZip(LPCTSTR lpszSrcDir,LPCTSTR lpszZipFullName, std::vector<LPCTSTR> &vFileName);

	// ------------------------------------------------------------------------------------------------------------------------
	// Summary:
	//   压缩指定路径下的文件，并保存压缩包到指定路径。
	// Parameters:
	//   lpszSrcDir        - 待压缩文件所在的路径; 如"D://00"。
	//   lpszZipFullName    - 压缩完成后，存放压缩包的整个路径（D://00//abc.zip）。
	// Returns:
	//   压缩成功返回ZR_OK，压缩失败返回错误码。
	// ------------------------------------------------------------------------------------------------------------------------
	DWORD CompressDirToZip(LPCTSTR lpszSrcDir,LPCTSTR lpszZipFullName);

	// ------------------------------------------------------------------------------------------------------------------------
	// Summary:
	//   压缩指定路径下的文件夹，并保存压缩包到指定路径。
	// Parameters:
	//   lpszSrcDir        - 待压缩文件所在的路径; 如"D://00"。
	//   lpszZipFullName    - 压缩完成后，存放压缩包的整个路径（D://00//abc.zip）。
	// Returns:
	//   压缩成功返回ZR_OK，压缩失败返回错误码。
	// ------------------------------------------------------------------------------------------------------------------------
	DWORD CompressDirsToZip(LPCTSTR lpszZipFullName, std::vector<LPCTSTR> &vSrcDirs);
}